     D CalcNewSweepDate...
     D  123            PR                  EXTPGM('MSR173')
     D  Goodville_VehSymbolCd...                                                Pers risk symbol
     D                               17a