     D myproc          PR                  extproc('mylongservice-
     D                                     programname_with_a-
     D                                     procedure')     
