     P NS_updateNotificationHistory...
     P                 B                   EXPORT
     D NS_updateNotificationHistory...
     D                 PI
     D  ppCurrentTimeStamp...
     D                                 z   VALUE
     D  ppAppSource...
     D                                     LIKE(xpAppSource) CONST
     D  ppUserId...
     D                               10a   CONST
     P                 E                   EXPORT
	
