      *.. 1 ...+... 2 ...+... 3 ...+... 4 ...+... 5 ...+... 6 ...+... 7 ...+... 8 ...+... 9 ...+... 10
     D*ame+++++++++++ETDsFrom+++To/L+++IDc.Keywords+++++++++++++++++++++++++++++Comments++++++++++++
     D open            PR            10I 0 ExtProc('open')
     D  filename                       *   Value
     D  openflags                    10I 0 Value
     D  mode                         10U 0 Value options(*nopass)
     D  codepage                     10U 0 Value options(*nopass)
