       DCL-PR printf INT(10) ExtProc('Qp0zLprintf');
         OutputString POINTER Value OPTIONS(*STRING);
         *N POINTER Value OPTIONS(*STRING:*NOPASS);
         *N POINTER Value OPTIONS(*STRING:*NOPASS);
         // ....
       END-PR;
