      **********************************************************************
     d wwdata          ds
     d  wwpcom                 1      4
     d  wwrest                 5    256 
      *