       DCL-DS PRT_DS LEN(132) END-DS;
       
       //Two equivalent data structures (END-DS)
       DCL-DS myrecord EXT;
       END-DS; 
       DCL-DS myrecord EXT END-DS;