     D ObjPtr          S               *   Inz(%addr(objName))
     C                   Eval      ReturnDir = opendir(%addr(FullName))
      /free
         P = %addr(subf);
         if %addr(chatfld) = %ADDR(SUBF);
         P = %ADDR (ARRAY (X + 10));
         endif;
         prefix_size = %addr(fld : *data) - %addr(fld);
      /end-free 
                 