     C                   EVAL      @SECS = %DIFF(T2:T1:*SECONDS)
      /free
         @secs = %diff(t2:t1:*seconds); //comment
      /end-free 
                 