     C                   if       %eof
     C                   endif
     C                   if       %eof()
     C                   endif
     C                   if       %eof(thefile)
     C                   endif
                 