     C                   EVAL      HH = %SUBDT(T3: *H)
     C                   EVAL      MN = %SUBDT(T3: *MN)
     C                   EVAL      SC = %SUBDT(T3: *S )
      /free
         hh = %subdt(t3:*H); //comment
         mn = %subdt(t3:*mn); //comment
         sc = %subdt(t3:*S); //comment
      /end-free 
                 