      //---------------------------------------------------------------
     Iorctl     ns       12 cX   13 cX
      // company names
     I                                 14   43  k3conm
     I                                 44   45  dftwhc
     I          ns       12 cI   13 cU