     P                 B
     D Function        PI            10I 0                                                         
     D    Term1                       5I 0 VALUE
     D    Term2                       5I 0 VALUE
     D Result          S             10I 0      
         return Result;
     P                 E