      * The RPG source, using the ALIAS keyword:
     Fmyfile    if   e             disk    ALIAS QUALIFIED
     D myDs            ds                  LIKEREC(myfile.custRec)