       dcl-f table1 DISK COMMIT;
       dcl-f table1 DISK keyed commit(always);
     FCOLMBID   UF A E           K DISK    COMMIT(C_COLMBID)             