     FINWCTL01  IF   E           K DISK                                                  
     F                                     RENAME(INWCTLR:INWCTLR01)       
     FINWCTL02  IF   E           K DISK    QUALIFIED                                              
     F                                     RENAME(INWCTLR:INWCTLR02)            
