        DCL-S duedate DATE;
        DCL-S displayDate DATE(*YMD);
        DCL-S startTime TIME;
        DCL-S displayTime TIME(*USA);
        DCL-S start TIMESTAMP;