01   D Int1            S              3I 0
02      dcl-s Int1 int(3) ;

03   D Uns1            S              3U 0
04      dcl-s Uns1 uns(3) ;
 
05   D Float1          S              8F
06      dcl-s Float1 float(8) ;
