       dcl-s a char(1) INZ('A');
       dcl-s b char(1) INZ(*SYS);
       dcl-s c char(1) INZ(*JOB);
       dcl-s d char(1) INZ(*EXTDFT);
       dcl-s e char(1) INZ(*NULL);
       dcl-s f char(1) INZ(*USER);
       dcl-s g char(1) INZ(*LIKEDS);