        // Define using the LIKE keyword 
        DCL-S cust_index LIKE(index);

        //Specify length adjustment with LIKE keyword 
        DCL-S big_index LIKE(index : +6);