//   D*ame+++++++++++ETDsFrom+++To/L+++IDc.Keywords+++++++++++++++++++++++++++++Comments++++++++++++
Rlc02D #POAllowA       S             +2    Like(PIQALBC) Inz(0)
Rlc02D #POAllowB       S             +2    Like(PIQALBC) Inz(0)