01   D Packed1         S              7P 0
02      dcl-s Packed1 packed(7) ;

03   D Packed2         S              5  2
04      dcl-s Packed2 packed(5:2) ;
        DCL-S numRecords PACKED(5);
        DCL-S salary PACKED(15:2);