01   D Date1           S               D   datfmt(*iso)
02      dcl-s Date1 date(*iso) ;

03   D Time1           S               T
04      dcl-s Time1 time ;

05   D TimeStamp1      S               Z
06      dcl-s TimeStamp1 timestamp ;
