     C                   If        SP > 0
     C                   Eval      DataValue = %Replace('&amp;' : DataValue: +
     C                                          %Scan('[' : DataValue): 1)
     C                   EndIf
