     C     AdaddCtl      Begsr
     C                   If        ##opt = '1' and ##sup <> *blanks and
     C                             @run = 0 and *in30 = *off
     C                   Exsr      AdAddWdw
     C                   Endif
     C                   Endsr
