      * If SFLRCD invalid, note that errors present
     C   98
     CANN99              SETON                                        99    *              