     D testUnitMeasureShortDescription...
     D                 PR                  extproc('TESTUNITMEASURESHORTDESCRIP-
     D                                     TION_UTS007')
     D                                     like(typeMessageID)
     D  unitMeasureShortDescription...
     D                                     like(typeUnitMeasureShortDescript...
     D                                     ion_UTS007) const
     D
     D  unitMeasureCode...
     D                                     like(typeUnitMeasureCode_UTS007)
     D                                     options(*nopass)
     D  unitMeasureLongDescription...
     D                                     like(typeUnitMeasureLongDescript...
     D                                     ion_UTS007)
     D                                     options(*nopass)
