     DgetUnitMeasureLongForeignDescription...
     D                 PR                  like(typeUnitMeasureLongDescript ...
     D                                     ion_UTS007)
     DunitMeasure01                        like(typeUnitMeasureCode_UTS007)
     D                                     const
     Dlanguage                             like(typeLanguage) const