     O                                           80 'Mary had a little lamb, its-
       
      *
      * Only a comment or a completely blank line is allowed in here
     O                                              fleece was white as snow.'
