     DMARY             C                   CONST(
     D                                     'Mary had a little lamb, its -
      * Only a comment or a completely blank line is allowed in here
     D                                     fleece was white as snow.'
     D                                     )
      * Numeric literal, continues with the first non blank in/past position 44
      *
     DNUMERIC          C                   12345
     D                                       67
      * Graphic named constant, must have shift-out in/past position 44
     DGRAF             C                   G'oAABBCCDDi+
     D                                      oEEFFGGi'
