     F someFile
     F                                     EXTIND
     F                                     (
     F                                     *INU1
     F                                     )