      * Long name without continued name lines:
     D RatherLongName  S             10A
      * Long name using 1 continued name line:
     D NameThatIsEvenLonger...
     D                 C                   'This is the constant -
     D                                     that the name represents.'
      * Long name using 1 continued name line:
     D NameThatIsSoLongItMustBe...
     D   Continued     S             10A
      * Compile-time arrays may have long names:
     D CompileTimeArrayContainingDataRepresentingTheNamesOfTheMonthsOf...
     D  TheYearInGermanLanguage...
     D                 S             20A   DIM(12) CTDATA PERRCD(1)
      * Long name using 3 continued name lines:
     D ThisNameIsSoMuchLongerThanThe...
     D    PreviousNamesThatItMustBe...
     D    ContinuedOnSeveralSpecs...
     D                 PR            10A
     D parm_1                        10A   VALUE
      *
      * Long names defined on calc spec:
     C     LongTagName   TAG
     C     *LIKE         DEFINE    RatherLongNameQuiteLongName    +5
      *
      * Long name specified on Procedure spec:
     P ThisNameIsSoMuchLongerThanThe...
     P    PreviousNamesThatItMustBe...
     P    ContinuedOnSeveralSpecs...
     P                 B
     D ThisNameIsSoMuchLongerThanThe...
     D    PreviousNamesThatItMustBe...
     D    ContinuedOnSeveralSpecs...
     D                 PI            10A
     D parm_1                        10A   VALUE
     P                 E     
