     c   16
     cann15              dou       *in25 = *on
     c     hrkey         reade     hcivhrl2                               25                                           
     c                   enddo
