     D Error_12        C                   ' No longer Exists on the File - +  
     D                                      Press Enter to Continue' 
