     C                   EVAL     getFileByName('SROORSHE')
     C                   EVAL     _getFileByName('SROORSHE')

      /free
         _getFileByName('SROORSHE'); 
      /end-free 
                 
