01   D Constant1       C                   const('ABCDEFG')
02   D Constant2       C                   'ABCDEFG'

03      dcl-c Constant1 const('ABCDEFG') ;
04      dcl-c Constant2 'ABCDEFG' ;
