     C/COPY MBR1
     I/INCLUDE SRCFIL,MBR2
     O/COPY SRCLIB/SRCFIL,MBR3
     O/INCLUDE "SRCLIB!"/"SRC>3","MBR¬3"
     O/COPY /dir1/dir2/file.rpg
     O/COPY /dir1/dir2/file
     O/COPY dir1/dir2/file.rpg
     O/COPY "ifs file containing blanks"
     O/COPY 'ifs file containing blanks'