     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C                   ADD       1             RECNO
     C     OVRTM         Add       REGHRS        CURRHRS
     C                   add       EHRK          TOTHRS
     C                   SETON                                        LR  
