     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C                   ADDDUR    XX:*YEARS     DUEDATE
     C     LDATE         Adddur    23:*D         CURRHRS
     C     T'00:00 am'   adddur    12:*Hours     result 
     C     '98/05/30'    adddur    1:*MONTH      result 
     C                   SETON                                        LR  
