     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C                   ALLOC     7             ptr1
     C                   Alloc(e)  100           ptr2
     C                   alloc     10            ptr3
     C                   SETON                                        LR  
