     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C     P1            begsr
     C                   endsr
     C     P2            BEGSR
     C                   ENDSR
     C                   SETON                                        LR  
