     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C                   BITON     '046'         Field
     C                   BITON     BITFLD        Field
     C                   SETON                                        LR  
