     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C     Field1        CABLT     FIELDB        TAGX
     C     Field1        CABLE     FIELDB        TAGX
     C     Field1        CABLE     FIELDB        TAGX                     16 
     C     Field1        CAB       FIELDB        TAGX                 1718  
     C     Field1        CAB       FIELDB        TAGX                     19  
     C     Field1        cabgt     FIELDB        TAGX
     C     Field1        CABge     FIELDB        TAGX
     C     Field1        CABEQ     FIELDB        TAGX                   20
     C     Field1        CABEQ     FIELDB        TAGX                 21
      *
     C     TAGX          TAG
     C                   SETON                                        LR  
