     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C                   CALL      'PROGRA'
     C                   parm                    p1
     C                   call      'PROGRA'
     C                   parm                    p1
     C                   CALL(e)   'PROGRA'
     C                   parm                    p1
     C                   CALL      'PROGRA'                             12
     C                   parm                    p1
     C                   CALL      'PROGRA'                               13
     C                   parm                    p1
     C                   CALL      'PROGRA'      PLIST                    12
     C                   Call(e)   'PROGRA'      PLIST                    
      *
     C                   SETON                                        LR  
