     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C                   CALLB     'PROGRA'
     C                   parm                    p1
     C                   callb     'PROGRA'
     C                   parm                    p1
     C                   CALLB(e)  'PROGRA'
     C                   parm                    p1
     C                   CALLB(d)  'PROGRA'                             12
     C                   parm                    p1
     C                   CALLB     'PROGRA'                               13
     C                   parm                    p1
     C                   CALLB     'PROGRA'      PLIST                    12
     C                   Callb(e)  'PROGRA'      PLIST   
     C                   callb     PROCptr
     C                   parm                    p1
      *
     C                   SETON                                        LR  
