1.27 C                   CALL      'MSGSFLCL'                               
1.28 C                   PARM                    MSGID             7        
1.29 C                   PARM                    MSGF             10        
1.30 C                   PARM                    MSGDTA           62        
1.31 C                   PARM                    MSGOPT            1 