     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C     Field1        CASLT     FIELDB        SUBR
     C     Field1        CASLE     FIELDB        SUBR
     C     Field1        CASLE     FIELDB        SUBR                     16 
     C     Field1        CAS       FIELDB        SUBR                 1718  
     C     Field1        CAS       FIELDB        SUBR                     19  
     C     Field1        casgt     FIELDB        SUBR
     C     Field1        CASge     FIELDB        SUBR
     C     Field1        CASEQ     FIELDB        SUBR                   20
     C     Field1        CASEQ     FIELDB        SUBR                 21
     C                   ENDCS
      *
     C     SUBR          BEGSR
     C                   ENDSR
     C                   SETON                                        LR  
