     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C     NAME          CAT       FIRST         Result
     C                   Cat       FLD:2         FLD3
     C     'lit'         cat       Fl3:5         fl4
     C     'lit'         cat       Fl3:5         fl4              10 
     C     'lit'         cat(p)    last:num      fl4              10
     C     'lit'         cat(p)    last:num      fl4              
     C                   SETON                                        LR  
