     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C     Digits        CHECKR    Salary:2      result
     C     ' '           Checkr    String        num
     C     ' '           Checkr    String        num               2 0    99
     C     ' '           Checkr    String        num                    99
     C     G'0A'         checkr    String        num
      *
     C                   SETON                                        LR  
