     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C     Digits        CHECK     Salary:2      result
     C     ' '           Check     String        num
     C     ' '           Check     String        num               2 0    99
     C     ' '           Check     String        num                    99
     C     G'0A'         check     String        num
      *
     C                   SETON                                        LR  
