     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C     Field1        COMP      FIELDB                             11
     C     Field1        COMP      FIELDB                             1112
     C     Field1        comp      FIELDB                               1213
     C     Field1        Comp      FIELDB                             111213
    
     C                   SETON                                        LR  
