     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C     *LIKE         DEFINE    FLDA          FLDB
     C*     *LIKE         DEFINE    FLDA          FLDB             +2
     C*     *LIKE         DEFINE    FLDA          FLDB          -   1
     C     *DTAATA       DEFINE    FLDA          FLDB
     C     *DTAATA       DEFINE    FLDA          FLDB             10 2
     C     *DTAATA       DEFINE    *LDA          FLDB
     C                   SETON                                        LR  
