     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C     Field1        DIV       FIELDB        RESULT               
     C                   Div       FIELDB        RESULT 
     C                   div(H)    FIELDB        RESULT                    
    
     C                   SETON                                        LR  
