1.00 DA                S              2P 0 INZ(25)                                   130128
2.00 DB                S              2P 0 INZ(11)                                   130128
3.00  *                                                                              130128
4.00 C     A             DIV       B             C                 2 0               130128
5.00 C                   MVR                     D                 2 0               130128
6.00 C     C             DSPLY                                                       130128
7.00 C     D             DSPLY                                                       130128
8.00 C                   SETON                                        LR             130128