     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C                   DO        10            X                 3 0
     C                   ENDDO    
     C     5             DO        10            X                 3 0
     C                   ENDDO
     C   10              do        10            X                 3 0
     C                   enddo
     C   10              do        10            X                 3 0
     C   50              enddo     2    
     C   10              do        10            X                 3 0
     C                   end         
    
     C                   SETON                                        LR  
