     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C     *in01         DOUEQ      *OFF 
     C                   ENDDO   
     C     fld01         doueq      fld02
     C                   enddo
     C     *in01         DOUGT      *OFF 
     C                   ENDDO   
     C     fld01         dougt      fld02
     C                   enddo
     C     *in01         DOUGE      *OFF 
     C                   ENDDO   
     C     fld01         douge      fld02
     C                   enddo
     C     *in01         DOULT      *OFF 
     C                   ENDDO   
     C     fld01         doult      fld02
     C                   enddo
     C     *in01         DOULE      *OFF 
     C                   ENDDO   
     C     fld01         doule      fld02
     C                   enddo
    
      *
     C                   SETON                                        LR  
