     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C     *in01         DOWEQ      *OFF 
     C                   ENDDO   
     C     fld01         doweq      fld02
     C                   enddo
     C     *in01         DOWGT      *OFF 
     C                   ENDDO   
     C     fld01         dowgt      fld02
     C                   enddo
     C     *in01         DOWGE      *OFF 
     C                   ENDDO   
     C     fld01         dowge      fld02
     C                   enddo
     C     *in01         DOWLT      *OFF 
     C                   ENDDO   
     C     fld01         dowlt      fld02
     C                   enddo
     C     *in01         DOWLE      *OFF 
     C                   ENDDO   
     C     fld01         dowle      fld02
     C                   enddo
    
      *
     C                   SETON                                        LR  
