     C     *ENTRY        PLIST
     C                   PARM                    OLDLIB1
     C                   PARM                    NEWLIB1
     C                   PARM                    OLDLIB2
     C                   PARM                    NEWLIB2