     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C                   EXCEPT          
     C                   EXCEPT    FMT01
     
      /Free
          EXCEPT;
          except fmt01;
          
      /end-free
      *
     C                   SETON                                        LR  
