     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *        
     C                   EXTRCT    LDATE:*M      LMON              2 0
     C                   Extrct    LDATE:*M      LMON              2 0  99
     C                   extrct(e) LDATE:*D      LMON              2
     C                   SETON                                        LR  
