     C                   FOR       X = 1 to 10 
     C                   ENDFOR   
     C                   For       X1 = 1 by 1 to 10
     C                   endfor
     C                   For       X1= 10 downto 1
     C                   Endfor
     C                   FOR       X= 10 by 1 downto 1
     C                   endfor
     C                   for       X1= %len(str) by 1 downto 1
     C                   endfor