     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *        
     C                   FORCE     FILE                              
     C                   Force     myfile
      /Free
          FORCE myfile;
          force myfile;

      /end-free
      *
     C                   SETON                                        LR  
