     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *        
     C                   GOTO      LAB1                              
     C                   goto      lab2
      *
     C                   SETON                                        LR  
