     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C     Field1        IFEQ      FIELDB 
     C                   ENDIF       
     C     Field1        ifeq      FIELDB        
     C                   endif
     C     Field1        IFLT      FIELDB 
     C                   ENDIF       
     C     Field1        iflt      FIELDB        
     C                   endif
     C     Field1        IFLE      FIELDB 
     C                   ENDIF       
     C     Field1        ifle      FIELDB        
     C                   endif
     C     Field1        IFGT      FIELDB 
     C                   ENDIF       
     C     Field1        ifgt      FIELDB        
     C                   endif
     C     Field1        IFGE      FIELDB 
     C                   ENDIF       
     C     Field1        ifge      FIELDB        
     C                   endif 
      *  
     C     Field1        IFEQ      FIELDB 
     C     Field1        ANDEQ     FIELDB
     C     Field1        ANDGT     FIELDB
     C     Field1        ANDGE     FIELDB
     C     Field1        ANDLT     FIELDB
     C     Field1        ANDLE     FIELDB
     C                   ENDIF       
     C     Field1        ifeq      FIELDB        
     C     Field1        andeq     FIELDB
     C     Field1        andgt     FIELDB
     C     Field1        andge     FIELDB
     C     Field1        andlt     FIELDB
     C     Field1        andle     FIELDB
     C                   endif 
      *  
     C     Field1        IFEQ      FIELDB 
     C     Field1        OREQ      FIELDB
     C     Field1        ORGT      FIELDB
     C     Field1        ORGE      FIELDB
     C     Field1        ORLT      FIELDB
     C     Field1        ORLE      FIELDB
     C                   ENDIF       
     C     Field1        ifeq      FIELDB        
     C     Field1        oreq      FIELDB
     C     Field1        orgt      FIELDB
     C     Field1        orge      FIELDB
     C     Field1        orlt      FIELDB
     C     Field1        orle      FIELDB
     C                   endif    
       
      *

     C                   SETON                                        LR  
