     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *        
     C                   ITER
     C                   iter      
      /Free
          iter;
          ITER;

      /end-free
      *
     C                   SETON                                        LR  
