     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *        
     C     FILEKEY       KLIST
     C                   KFLD                    KEY1  
     C     FILEKEY       KLIST
     C                   KFLD       INDICATOR    KEY1  
     C     FILEKEY       klist
     C                   kfld                    KEY1  
     C     FILEKEY       klist
     C                   kfld       INDICATOR    KEY1   
      *
     C                   SETON                                        LR  
