     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *        
     C                   LEAVE
     C                   leave     
      /Free
          leave;
          LEAVE;

      /end-free
      *
     C                   SETON                                        LR  
