     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *        
     C                   LEAVESR
     C                   leavesr     
      /Free
          leavesr;
          LEAVESR;

      /end-free
      *
     C                   SETON                                        LR  
