     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *        
     C     SRCH          LOOKUP    ARY(X)                                 98
     C     SRCH          LOOKUP    ARY                                    98
     C     SRCH          LOOKUP    ARY           TABRES               97  
     C     SRCH          lookup    ARY                                  99        

     C                   SETON                                        LR  
