     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *        
     C                   MOVEA     Arr1          ARR2 
     C                   MOVEA(p)  Arr1          ARR2  
     C                   MOVEA     *ALL'*'       ARR2(X) 
     C                   MOVEA     *blank        ARR2(X)
     C                   movea     '123'         ARR2(X)
     C                   movea     arr(c)        ARR2
     C                   SETON                                        LR  
