     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *  
     C     A             DIV       B             C                 2 0             
     C                   MVR                     D                 2 0
     C     A             div       B             C                             
     C                   mvr                     D                  
      *                                                                   
     C                   SETON                                        LR             