     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *        
     C                   MHHZO     SRC           TARG  
     C                   mhhzo     SRC           TARG 
     C                   MHLZO     SRC           TARG  
     C                   mhlzo     SRC           TARG  
     C                   MLHZO     SRC           TARG  
     C                   mlhzo     SRC           TARG 
     C                   MLLZO     SRC           TARG  
     C                   mllzo     SRC           TARG            
      

     C                   SETON                                        LR  
