     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *        
     C     2             OCCUR     DS1 
     C     X             Occur     DS1 
     C                   occur     DS1           Z
     C     X             occur     DS1           Z
     C     X             occur(e)  DS1           Z
     C     X             occur     DS1           Z                      99
     
     C                   SETON                                        LR  
