     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C     LIST1         PLIST
     C                   PARM                    VAR
     C                   PARM                    VAR2              5 2
     C                   PARM      *IN27         BYTE
     C     *IN30         PARM      *IN27         BYTE
     C     FLD1          parm      fld2          FLD3
     C                   PARM                    *OMIT
      *
     C     *ENTRY        PLIST
     C                   PARM                    VAR
      *

     C                   SETON                                        LR  
