     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C                   REALLOC   7             ptr1
     C                   ReAlloc(e)100           ptr2
     C                   realloc   10            ptr3                   99
     C                   SETON                                        LR  
