     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C                   ROLBK
     C                   rolbk(e)
     C                   rolbk                                          99
      /Free
          rolbk;
          ROLBK(e);
      /end-free
      *
     C                   SETON                                        LR  
