     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C     'ABC'         SCAN      'XXABC'       RES                      99
     C     FLD:2         SCAN      FLD:3         RES                
     C     G'oXXi'       SCAN      XX:2          RES                         
      *
     C                   SETON                                        LR  
