     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
     C                   Parm                    w_RtnValue
      *
     C                   SETOFF                                       97
     C                   Setoff                                       979899
     C                   setoff                                         9899
     C                   SETON                                        97
     C                   Seton                                        979899
     C                   seton                                          9899
     C*     
     C                   SETON                                        LR  
