     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
     C                   Parm                    w_RtnValue
      *
     C                   SHTDN                                        97
     C                   shtdn                                        97
     C                   SETON                                        LR  
