     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
     C                   Parm                    w_RtnValue
      *
     C                   SQRT      FAC1          RES
     C                   sqrt(h)   FAC1          RES
       
