     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C                   SUBDUR    XX:*YEARS     DUEDATE
     C     LDATE         Subdur    23:*D         CURRHRS
     C     T'00:00 am'   subdur    12:*Hours     result               
     C     '98/05/30'    subdur    1:*MONTH      result                 99
     C                   SETON                                        LR  
