     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C     2             SUBST     'XXABC'       RES                    99
     C     FLD:2         SUBST     FLD:3         RES                
     C     FLD           subst     XX:2          RES   
     C     FLD           Subst(P)  XX:2          RES                         
      *
     C                   SETON                                        LR  
