     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C     LAB           TAG
     C     lab2          tag           
      *
     C                   SETON                                        LR  
