     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C                   TESTZ                   Tfld                 16  17
     C                   Testz                   Tfld                 161817
     C                   testz                   Tfld                 16   
     C                   TESTZ                   Tfld                 161817
     C                   SETON                                        LR  
