     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C                   TESTN                   Tfld                 16  17
     C                   TestN                   Tfld                 161817
     C                   testn                   Tfld                 16   
     C                   TESTN                   Tfld                 161817
     C                   SETON                                        LR  
