     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C                   TESTB     '3'           Tfld                 16  17
     C                   TestB     '35'          Tfld                 161817
     C                   testb     FLDA          Tfld                 16   
     C                   TESTB     X'88'         Tfld                 161817


     C                   SETON                                        LR  
