     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C                   TIME                    TFLD              6 0
     C                   Time                    TFLD1            12 0
     C                   time                    TFLD2            
     
     C                   SETON                                        LR  
