     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C                   SELECT
     C     Field1        wheneq    FIELDB   
     C     Field1        WHENEQ    FIELDB 
     C     Field1        whengt    FIELDB   
     C     Field1        WHENGT    'B' 
     C     Field1        whenlt    FIELDB   
     C     Field1        WHENLT    FIELDB 
     C     'F'           whenge    FIELDB   
     C     Field1        WHENGE    FIELDB 
     C     Field1        whenle    'R'   
     C     Field1        WHENLE    FIELDB 
     C                   OTHER    
     C                   ENDSL
  
     C                   SELECT
     C     Field1        wheneq    FIELDB   
     C     Field1        WHENEQ    FIELDB 
     C     Field1        ANDEQ     FIELDB 
     C     *IN01         OREQ      *OFF
     C                   OTHER    
     C                   ENDSL
      *

     C                   SETON                                        LR  
