     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C                   XFOOT     ARR           RES
     C                   xfoot     ARR           RES              12 0 
     C                   XFOOT(h)  ARR           RES
     C                   SETON                                        LR  
