     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C     lo:Up         XLATE     String        res    
     C     lo:Up         XLATE     String        res                    88
     C     lo:Up         xlate(e)  String        res      
     C     Up:Lo         XLATE     String:6      res 
     C     ' ':'-'       XLATE     Number        res
     
     C                   SETON                                        LR  
