     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C                   Z-ADD     1             RECNO
     C                   z-add     EHRK          TOTHRS
     C                   z-add(h)  arr(x)        TOTHRS
     C                   SETON                                        LR  
