     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     *Entry        PList
      *
     C                   Z-SUB     1             RECNO
     C                   z-sub     EHRK          TOTHRS
     C                   z-sub(h)  arr(x)        TOTHRS
     C                   SETON                                        LR  
