     C                   IF        P1IAMT > 0
     C                   IF        WURMCD = 'CPR'
     C                   ELSE
     C                   END                                                    *FI
     C                   ELSE
     C                   END                                                    *FI
      *----------------------------------------------------------------
     CSR   NACHRC        BEGSR
     CSR   NACHRC        ENDSR
