     C                   IF        P1IAMT > 0
     C                   IF        WURMCD = 'CPR'                               *INDENT+1
     C                   ELSE
     C                   END                                                *FI CODE SMELL
     C                   ELSE
     C                   END                                                *FI CODE SMELL
      *----------------------------------------------------------------
     CSR   NACHRC        BEGSR
     CSR   NACHRC        ENDSR
