     C*0N01Factor1+++++++Opcode(E)+Factor2+++++++Result++++++++Len++D+HiLoEq....
     C     FFQZUAT       IFEQ      'P         '
     C                   EVAL      XWQTY=FFQZUN9*FFIPKPC/10000
     C                   ENDIF
