     C     FIELDA        IFGT      FIELDB
     C     FIELDA        ANDGE     FIELDC
     C     FIELDA        ORLT      FIELDD
     C     FIELDA        ANDGE     FIELDE
     C                   SETON 
     C                   ELSE
     C                   SETOFF
     C                   ENDIF
