     c                   if        retst = 4 or
     c                             retst = 2
     c                   eval      retst = 1
     c                   endif