       DCL-S X Int(10);
       EXSR SUBRT1;
     C                   BEGSR     SUBRT1                                      
         X = 1234;
     C                   ENDSR     SUBRT1                                      
     