     C     FLDA          DOUEQ     FLDB
     C                   SUB       1             FLDA
     C                   OPEN      CUST
     C                   ENDDO
