     C     FLDA          DOWEQ     FLDB
     C                   SUB       1             FLDA
     C                   OPEN      CUST
     C                   ENDDO
