     C     STARTDT       ADDDUR    YY:*MONTHS    TEST
     C                   ADDDUR    YY:*M         TEST
     C                   ADDDUR    YY:*DAYS      TEST
     C                   ADDDUR    YY:*D         TEST
     C                   ADDDUR    YY:*YEARS     TEST
     C                   ADDDUR    YY:*Y         TEST
     C                   ADDDUR    YY:*SECONDS   TEST
     C                   ADDDUR    YY:*S         TEST
     C                   ADDDUR    YY:*MINUTES   TEST
     C                   ADDDUR    YY:*MN        TEST
     C                   ADDDUR    YY:*HOURS     TEST
     C                   ADDDUR    YY:*H         TEST
     C                   ADDDUR    YY:*MSECONDS  TEST
     C                   ADDDUR    YY:*MS        TEST