     C     STARTDT       SUBDUR    YY:*MONTHS    TEST
     C                   SUBDUR    YY:*M         TEST
     C                   SUBDUR    YY:*DAYS      TEST
     C                   SUBDUR    YY:*D         TEST
     C                   SUBDUR    YY:*YEARS     TEST
     C                   SUBDUR    YY:*Y         TEST
     C                   SUBDUR    YY:*SECONDS   TEST
     C                   SUBDUR    YY:*S         TEST
     C                   SUBDUR    YY:*MINUTES   TEST
     C                   SUBDUR    YY:*MN        TEST
     C                   SUBDUR    YY:*HOURS     TEST
     C                   SUBDUR    YY:*H         TEST
     C                   SUBDUR    YY:*MSECONDS  TEST
     C                   SUBDUR    YY:*MS        TEST