     C     FILEKY        KLIST
     C                   KFLD                    DEPT
     C                   KFLD                    SHIFT
     C                   KFLD                    CLOCK#
