     C                   IF        FFAMTHC = 'F' AND
     C                             OOICLCD <> 'N' AND
     C                             OOIITMN <> '9999999999' AND
     C**                         OOIEXAC <> *ZERO AND
     C                             OOIUINV <> 'N'
     C                   EVAL      YYFITMN = OOIITMN
     C                   ENDIF