       DCL-DS data_str_1; 
       // Program described data structure 
           emp_name CHAR(10); 
           first_name CHAR(10); 
       END-DS; 