     D JBDTTM          DS                                                                           
      * Job date/time                                                                               
     D  ##JDT                  1      7  0                                                          