     C                   SELECT
     C                   WHEN      IDCCA1Z = @PRIME1                        
     C                   EVAL      TYPE = '5'
     C                   ENDSL                                              Subf                                                                                 
