     P unappliedChanges...
     P                 B
     D                 PI              N
     D  inLocation                         like(typeLocation) const
     D                                     options(*nopass)
      /free

      /end-free
     P unappliedChanges...
     P                 E
      //========================================================================
      //ÎProcedure getCompanyEcommLoc_COS001
      //========================================================================
      // .....
      //========================================================================
     P getCompanyEcommLoc...
     P                 B                   export
     D                 PI                  like(typeEcommResultSetBlock_COS001)
     D                                     dim(5)
     D inCompany                           like(typeCompany) const
      /free

      /end-free
     P getCompanyEcommLoc...
     P                 E                                                        //test
      //Test